tsung_logs/user_login_first_try/simple.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="100"/>
  </clients>

  <servers>
    <server host="irenepawena.3hfpeaqsam.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second" maxnumber="1000"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>
    <session name="Make Post" probability="100" type="ts_http">
      <transaction name="Get_Root">
              <request>
                <http url="/"/>
              </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Get_Register">
              <request>
                      <dyn_variable name="authenticity_token"/>
                      <http url="/register"/>
              </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
              <var name="authenticity_token"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="13">
              <var name="rnd_email"/>
      </setdynvars>

      <setdynvars sourcetype="random_string" length="13">
              <var name="rnd_user"/>
      </setdynvars>

      <thinktime random="true" value="2"/>

      <transaction name="Post_Register">
              <request subst="true">
                        <http url="/" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_rnd_email%%@gmail.com&amp;user%5Busername%5D=%%_rnd_user%%&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Sign+up"/>
              </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Redirect_Root">
              <request>
                <http url="/"/>
              </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Get_Logout">
        <request>
          <http url="/logout"/>
        </request>
      </transaction>

      <thinktime random="true" value="2"/>

      <transaction name="Get_Login">
        <request>
          <dyn_variable name="authenticity_token"/>
          <http url="/login"/>
        </request>
      </transaction>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
        <var name="authenticity_token"/>
      </setdynvars>

      <thinktime random="true" value="2"/>

      <transaction name="Post_Login">
        <request subst="true">
          <http url="/login" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=%%_rnd_email%%@gmail.com&amp;user%5Bpassword%5D=123456&amp;commit=Log+in"/>
        </request>
      </transaction>
    </session>
  </sessions>
</tsung>